# программа выводит несколько переменных разных типов и и адреса памяти
a = 5
b = 3.14
name = "'Денис'"
d_bool = True
com_dig = 1-3j
print('переменная а имеет значение: ', a,'\n','тип данных: ', type(a), '\n', 'адрес хранения: ', id(a), sep='')
print()
print('переменная b имеет значение: ', b,'\n','тип данных: ', type(b), '\n', 'адрес хранения: ', id(b), sep='')
print()
print('переменная name имеет значение: ', name,'\n','тип данных: ', type(name), '\n', 'адрес хранения: ', id(name), sep='')
print()
print('переменная d_bool имеет значение: ', d_bool,'\n','тип данных: ', type(d_bool), '\n', 'адрес хранения: ', id(d_bool), sep='')
print()
print('переменная com_dig имеет значение: ', com_dig,'\n','тип данных: ', type(com_dig), '\n', 'адрес хранения: ', id(com_dig), sep='')
